local base = GameMain:GetMod("NovelBase");
local Novel = GameMain:GetMod("Novel_004");

function Novel:Init()	
	self.API = base:new();
	self.API.text_list = nil
end

function Novel:GetNovel(index)
	return self.API:GetNovel(index)
end

function Novel:GetNovelAll()
	return self.API:GetNovelAll()
end

function Novel:InitRoles( player, target, target2, target3, ntr )
	self.API.text_list = {
	""..target.."一面嬌哼著，一面瘋狂的扭轉屁股，極力迎湊，同時兩手緊抱著"..player.."，加重抽送。"..player.."一看，知道她要出精了，忙用勁抽插，一面狂吻香唇。果然"..target.."混身顫抖，陰戶緊急收縮，一股火熱熱的陰精直瀉而出，灑得他龜頭全根發熨，同時嬌軀軟綿棉的，四肢平擺，嬌喘地道：「哎…唷…哥哥…我…我升天了…啊…太…舒服…美…美死…我了…」\n",
	"「啊﹍﹍弟弟﹍﹍再進來一點﹍﹍到我的最深處﹍﹍對﹍﹍頂緊我﹍﹍讓我知道你在我身體裡面﹍﹍啊﹍﹍好舒服﹍﹍啊﹍﹍我的好老公﹍﹍幹我﹍﹍乾姐姐﹍﹍幹你的淫蕩老婆！」師姐雙腿緊環住"..player.."，讓他插入陰道的最深處。\n",
	"「哎…呦…大雞巴哥哥…你的寶貝…好…好大喔…插得妹妹好舒服…啊…嗯…大寶貝哥哥…嗯…騷屄美上天了…啊…」"..player.."聽到"..target.."如此淫蕩的呼喊著，更加賣力的抽乾她的小穴，雙手則去玩弄她的雙乳。\n",
	"「啊…大雞巴哥哥…你…插死"..target.."了…嗯…呦…好哥哥…清影真幸福…嗯…嗯…我要…啊…要你天天…干…干…姐姐的小穴…嗯…嗯…」"..player.."扶起"..target.."的左腿，使她的小穴更開，而那小陰蒂更加突顯出來，"..player.."便伸手去扣挖那小陰唇和陰蒂。「啊…大雞巴哥哥…好哥哥…你的雞巴…好粗…好大…啊…嗯…快…啊…快…師姐…要出來了…啊…快洩了…好舒服…啊…嗯…啊…爽…爽死我了…」\n",
	""..target.."洩了一次之後，"..player.."抱起她往石頭上躺下。"..target.."依靠在"..player.."的胸膛上，用舌尖去舔舐著他的每一寸肌膚，最後停留在胸部，吸吮著他的奶頭。"..player.."則雙手去揉捏著"..target.."的乳頭，輕撫著那烏黑的秀髮。經過一陣的愛撫，"..target.."的小穴感到陣陣的麻癢，一股淫水不知覺的從小穴中汩汩而流，就起身舉腿跨過"..player.."的身體，握著他的寶貝對準小穴慢慢的坐下，因剛洩過小穴比較敏感，不敢大力坐下。\n",
	"「大雞巴哥哥…你的雞巴好粗…好長…啊…插得…哦…姐姐好爽…嗯…好舒服…嗯…」"..target.."說完之後，開始扭擺身體，運用腰力推送著寶貝，隨著她一節一節的運動，把"..player.."的寶貝一寸一寸的吞進小穴裡，"..player.."感覺到一波一波的快感侵襲而來，頂著腰力用力的將臀部往上送。\n",
	"「哎…呀…插死我了…啊…用力…嗯…用…用力幹…啊…姐姐…的小穴…爽…啊…啊…嗯…嗯…喔…快…快…快一點…啊…用你的大寶貝…插…妹妹的小穴…嗯…」"..target.."的雙腳夾得"..player.."更緊，讓小穴緊緊的包裹著他的雞巴，忘情地叫了又叫，腰也不斷的擺動，配合"..player.."的抽送，享受著欲仙欲死的性交。\n",
	"「啊…用力…好哥哥…大力的干…嗯…爽…太爽了…嗯…妹妹好舒服喔…嗯…啊…人家要大雞巴哥哥…用力…用力幹死姐姐…爽…好…棒…啊…啊…嗯…姐姐…爽…死了…嗯…」"..player.."瘋狂的將寶貝往上頂，"..target.."也瘋狂的擺動她的腰，配合"..player.."的寶貝往下坐，誰也不認輸。\n",
	"「嗯…好美喔…大雞巴哥哥哥…啊…嗯…你幹的姐姐好美…喔…嗯…啊…妹妹快…快受不了了…嗯…哎…呦…洩了…大雞巴哥哥…嗯…姐姐要…洩了…你幹死姐姐了…啊…嗯…大寶貝哥哥…妹妹…好爽…嗯…啊…你的寶貝…干…干的姐姐…好爽…嗯…快…讓姐姐爽死吧…」\n",
	"「姐姐，我也要射了。」\n",
	"「來吧…啊…射…射進姐姐…的小穴裡…嗯…啊…我…嗯…洩了…洩了…爽死我了…姐姐被你…插的好爽…」"..player.."立刻開放精關，將那又濃又密的精液，往"..target.."的小穴裡射，"..target.."受到"..player.."那火熱的精液一射，不自主的抖擻一下，軟綿綿的趴在"..player.."的身上。\n",
	}
	self.Count = #self.API.text_list
	self.API.Count = self.Count
end