local base = GameMain:GetMod("NovelBase");
local Story = GameMain:GetMod("Story_003");

function Story:Init()
	self.API = base:new();
	self.API.text_list = nil
end

function Story:GetNovel(index)
	return self.API:GetNovel(index)
end

function Story:GetNovelAll()
	return self.API:GetNovelAll()
end

function Story:SetChapter(index)
	if index > #self.chapter then
	return false
	end
	self.API.text_list = self.chapter[index]
	self.Count = #self.API.text_list
	self.API.Count = self.Count
	return true
end


function Story:InitRoles( player, target, target2, target3, ntr )
	self.chapter = {}
	self.CH1 = {
		""..player.."示意站在一旁的"..target2.."過來，"..target2.."溫馴的站過來。\n",
		"「你喜歡"..target2.."對不對，你真的很有眼光，我也很喜歡幹她，有人認爲漂亮的女人都不美麗，我卻不認爲，那是因爲那些男人沒本事征服聰明的女人，才說出這種酸葡萄的話，我喜歡讓漂亮聰明的女人以趴著的姿勢讓她爽，這一來最棒，讓聰明女人以最羞恥的姿態幹，她反而會更爽，我相信你一定也同意吧，瞧！"..target2.."的身體多漂亮，你剛才躲在上面偷看"..target2.."被幹的樣子，實在是太遠了，我現在在你面前再幹她一次，好讓你看得更仔細，讓你今生無憾，而且她最喜歡男人用大肉棒肏進屁眼中，瞧！被肉棒幹過的屁眼長的就是這樣子。」\n",
		""..player.."將"..target2.."推倒在地上，並分開她雪白的雙臀，他開始用舌頭舔著"..target2.."的屁眼，當舌頭輕輕碰觸到屁眼時，"..target2.."已經開始浪叫了。\n",
		"「好舒服的感覺，我喜歡被大肉棒插入屁眼中，喔！好舒服！」"..target2.."幾乎是大聲、自動的浪叫，她在心中也希望將"..target.."拉下來，她格外的賣力淫叫著，讓"..target.."的欲火再次燃起，她早知道"..target.."以前看她的眼光是充滿炙熱的情愛與肉欲，而"..target2.."也時常利用這一點在利用著"..target.."爲她做了不少事，她希望自己仍是操控"..target.."的人，縱使目前的她已是"..player.."跨下的性奴了。\n",
		""..target.."仔細看著"..target2.."身上每一寸肌膚，這是她魂縈夢遷的胴體，如今可以如此近距離的看著，但是卻在這樣的情況下見到的，她有種既幸福又可悲哀的感覺，這時候"..player.."坐在太師椅上，示意"..target2.."坐在他腿上，"..target2.."整個人依偎在"..player.."的懷中，"..player.."將"..target2.."的雙腿大大的分開掛在太師椅的扶手上，如此一來"..target2.."的雙股大開，她的陰戶與屁眼清清楚楚的映到正好被綁在前面的"..target.."面前，而"..target.."也仔細看著"..target2.."的身體，這時"..player.."開始用背後搓揉著"..target2.."雪白的乳房，而"..target2.."也將頭轉過去，兩人熱情的吻在一起，而"..player.."也將手探到雙腿間，用手指分開"..target2.."從濃濃陰毛中露出的陰唇，"..target.."看著"..target2.."被翻出的粉紅色肉壁，從那裏面看出已經滲出晶瑩的淫水了，她好希望這時是自己的手指狠狠的插入其中，而她也清楚的看見"..target2.."的屁眼處已經有點凹陷，看來已經被雞巴充分的開發過了。\n",
		""..player.."將"..target2.."的雙腿更是高高的舉起，讓她的臀部清清楚映在"..target.."的眼前，說：「瞧！"..target2.."的身體真的很漂亮吧，我要開始享用了！」\n",
		""..player.."示意"..target2.."將自己的屁股擡高，"..target2.."用手指握住大雞巴，對準自己的屁眼，緩緩的坐下，"..target.."張大眼看著這一幕，這是她第一次如此近距離看男女的性交，但卻是她最心儀的女人最別人幹，她一股又妒又欣喜的複雜情緒，她清楚看見"..target2.."的一切，但騎在她身上的人卻不是她，她看見"..target2.."的陰戶早已濕淋淋的，陰唇已經張開在等待男人的入侵，但是，這時，雞巴插入"..target2.."身體的部位卻是最肮髒的屁眼，但爲何"..target2.."的表情是如此的嬌媚與性感，這時龜頭已經完全的被屁眼所吞入了，"..target2.."緩緩的搖動自己的腰枝，讓插入屁眼的雞巴更深深的插入，她的口中傳來了似是痛苦又是快樂的呻吟。\n",
		""..player.."藉著先前的潤滑與及淫液之助，"..player.."輕而易舉的就進入了"..target2.."的菊洞之內，這一次"..player.."可沒那麽客氣了，甫一進入，就是一陣快速的抽送，更將左手手指插入"..target2.."的秘洞之內不停的抽插摳挖，不消片刻工夫，"..target2.."已經發覺從後庭的菊洞之內傳來陣陣快感，再加上"..player.."左手手指在桃源洞內不住的摳弄，粉頸玉背上還不時傳來"..player.."輕柔綿密的舐吻，陣陣快感如浪濤般襲來，至此，"..target2.."的理智終於崩潰，完完全全的沈醉在淫欲的浪潮之中……\n",
		"只見她隨著"..player.."的抽送，柳腰粉臀不停的篩動迎合，發出陣陣啪啪的撞擊聲，口中嗯啊之聲不絕於耳，嬌媚的語調媚惑得"..player.."更加的狂暴，就這樣的，"..player.."輪流的在"..target2.."的前後洞大刀闊斧的快意騁馳，插得"..target2.."幾近瘋狂，口中不停的淫叫著：「啊……好棒……好舒服……啊……太好了……再……再來……用力……哦……對…太好了……啊……又……來了……不行了……啊……我不行了……」整顆頭不停的左右搖擺，帶動如雲的秀髮有如瀑布般四散飛揚，嬌軀奮力的迎合"..player.."的抽插，一陣陣的乳波臀浪，真有一股說不出的淫靡美感。\n",
		"兩人就這樣瘋狂的交媾著，完全無視於在旁的"..target.."，約略過了一柱香的時間，"..target2.."終於忍受不住那股絕頂高潮，只見"..target2.."突然一頓，全身肌肉繃得死緊，擡頭叫道：「啊……不行了……啊……好舒服……好……好爽……啊……我……我泄了……」刹時一陣天旋地轉，全身不住的抽搐抖顫，"..player.."只覺"..target2.."的陰道嫩肉一陣強力的收縮旋轉，死命的夾纏著胯下肉棒，夾得"..player.."萬分舒適，急忙將肉棒緊緊的抵住屄心嫩肉不停的磨轉，轉得"..target2.."汗毛直豎，彷佛升上了九重天外，在一聲長長的尖叫聲中，一道滾燙的洪流急湧而出，燙得"..player.."的雞巴不住的跳動。\n",
		"泄完身後的"..target2.."，整個人癱在"..player.."的身上不停的嬌喘著，雙頰浮起一層妖豔的紅雲，嬌軀仍不住的微微顫動，再也無法動彈分毫，在一旁看的"..target.."早已欲念焚身、嘴乾舌躁了。\n",
		}
	self.CH2 = {
		""..player.."開始用手隔著衣服輕輕愛撫"..target.."，衣服輕輕摩擦著肌膚，"..target.."轉過頭不理會"..player.."的舉動，這時，他輕咬著"..target.."的耳垂，"..target.."忍不住從口吐出輕歎，彷佛是她苦惱的性欲終於可以宣洩一般，當男人的舌頭在她的臉上游走時，她不自覺的伸出舌頭讓"..player.."輕易的伸入口中，當"..player.."用力吸著她的舌頭時，她迫不及待地吞下"..player.."的口水，這時"..target.."在心中告訴自己一定要把持住，但是，男人的手如同魔術一般的將她的意志力不斷的消去，她終於在心中告訴自己就隨著感覺走吧！\n",
		""..player.."只解開"..target.."胸口前的兩顆扣子，讓領口滑下，好讓手輕易伸入，當手碰觸到"..target.."的乳房時，她小聲哼出：「嗯！」聲音中充滿了無限的期待，雖是小小的一聲，這表示"..target.."決定要追求那一份快感，"..player.."的手穿過了領口與褻衣，直襲"..target.."的乳頭，他先用掌心滑過已經充血的乳頭，然後用大姆指與食指輕捏住已經發硬的乳頭，"..target.."如同雷殛般身體向上挺，她感覺下體一股暖流已經將下體弄濕了，僅被愛撫乳頭就讓"..target.."達到輕微的高潮，原來是"..target.."無法再壓抑住那長期壓制的感覺，一下子宣洩出來，她開始呻吟著：「好舒服，繼續，我還要！用力！」原本冷豔的表情轉換成豔麗的粉紅色。\n",
		""..player.."看機不可失，將她的長褲與褻褲一次扯下，手直襲她最神秘的地方，當"..player.."的手指輕觸那早已腫脹的大陰唇時，"..target.."不禁又流出更多又濕又熱的淫水，他用食指沾了沾她的淫水，塗抹在"..target.."的櫻唇與鼻頭，說：「自己流出的騷水的味道如何？」"..target.."只能搖頭表示她的害羞，但是聞到、嚐到自己身體所流出的騷水卻讓自己感到更深的羞恥，她不想再反抗眼前的男人了，她任憑"..player.."在她的身上蹂躪，"..player.."蹲在地上，將"..target.."的大腿高高的舉起，放在自己的肩頭上，他將頭埋在"..target.."那已經洪水泛濫的下體了，他開始品嚐"..target.."流出的淫水，他的舌頭輕輕的滑過，"..target.."整個人震了一下，他得意看著冷豔的女殺手成了人盡可夫的蕩女，他突然站起，抽離了這美麗的胴體。\n",
		"跟著"..player.."拿了象牙棒，那是用象牙做的棍子。\n",
		"「讓你當嚐象牙棒的厲害。」說著將象牙棒湊到了"..target.."的屁眼上。\n",
		"「啊…不要！好髒！」"..target.."感到粗硬的棒子頂在自己的屁眼上，跟著叫了出來。\n",
		"「好硬哪！！」"..target.."心裏暗想著。\n",
		"突然她想起了"..target2.."屁眼曾被這棒木插進去過吧！\n",
		"「今天算是幫你開另一個苞。」\n",
		""..player.."邊說邊將手上的象牙棒往"..target.."那狹窄的菊花裏插了進去。\n",
		"從來沒有享受到這樣的感覺，"..target.."第一次體會到象牙棒的厲害了。\n",
		"「哦…」"..target.."發出了夾雜著痛苦的呻吟聲。\n",
		""..player.."繼續用力地將象牙棒往"..target.."的屁眼裏送，狹窄的屁眼被粗硬的象牙棒給硬撐了開來。除了疼痛以外，"..target.."居然感覺到了一絲絲的愉悅。\n",
		"「嘿嘿…見識到了吧！！」"..player.."邊說邊將象牙棒抽插在"..target.."的屁眼裏。\n",
		"「啊…哦…」"..target.."只覺快感越來越猛烈，嘴裏發出了淫蕩的呻吟聲。\n",
		"那被恥毛覆蓋著的陰戶毫無遮掩地呈現在"..player.."面前，由於淫水不斷從蜜屄裏滲出，因此大陰唇周圍全都沾滿了淫液，散發著粉紅色的淫靡的光澤。\n",
		""..player.."跟著將象牙棒湊在"..target.."的陰戶上摩擦著。\n",
		"「哦…好硬啊…」從口中吐出淫穢的語言，"..target.."感到堅硬的象牙棒在自己陰戶外摩擦著，一陣麻癢的感覺從陰戶深處傳了上來。\n",
		"象牙棒的前端沾滿了"..target.."的淫液，閃耀著威風的光芒。\n",
		"「請…快給我吧…」"..target.."再也受不了那種空虛的感覺，開始懇求起"..player.."。\n",
		"「嘿嘿…」"..player.."露出了奸笑，卻故意不將象牙棒插入陰戶裏。\n",
		"「拜託…我…受不了了！！」"..target.."幾乎快被陰戶中傳來的麻癢感給淹沒了。\n",
		"「哦…」"..target.."忽然發出了無比暢快的叫聲。\n",
		"原來是"..player.."趁她哀求時，猛地將象牙棒插入了她的騷屄中。沒想到"..player.."插入後，卻又故意停著不做抽插的動作。\n",
		"「求求你…求你用力抽插我的陰道吧…」"..target.."已被肉欲給埋沒了，嘴裏只是拼命哀求著。\n",
		"「哼哼」"..player.."發出了不屑的哼聲，這才動起手上的象牙棒。\n",
		"「哦…啊…」隨著象牙棒的進出，"..target.."發出了嬌喘聲。"..player.."逐漸加快象牙棒抽插的速度，"..target.."跟著越叫越大聲。忽然，"..target.."全身一陣痙攣，跟著大量的淫汁從她那濕答答的陰戶裏泄了出來。\n",
		"「哦…」"..target.."長叫一聲，跟著癱軟在地板上。\n",
		"「怎麽？這樣子就去啦？？？這樣子怎麽有資格當殺手呢？」"..player.."用十分不屑的語氣嘲弄著"..target.."，但是由於"..target2.."的挑逗，打跨她的心防，讓"..target.."完全的沈浸在性欲之中。\n",
		"「真是太沒用了！！」"..player.."跟著將癱軟的"..target.."給轉了個身，讓她面朝上躺著。然後用雙手把"..target.."的大腿向左右給張得開開的，剛到達高潮的蜜屄依舊一張一閉地吞吐著，大量的淫水更是從陰戶裏狂泄出來，直流到地板上。\n",
		}
	self.CH3 = {
		""..player.."將大雞巴在她的面前晃來晃去露了出來。\n",
		"「本來要你舔的，不過看你現在這副死樣子…」"..player.."咽了口口水後繼續說道。\n",
		"「就用你底下的嘴唇來吸吧…」說著將他那又黑又粗的雞巴湊在"..target.."的陰戶上摩擦，雞巴頓時沾滿了大量的淫水，黑黑亮亮的好不嚇人。\n",
		""..target.."感覺陰戶不斷被摩擦，一陣麻癢的感覺從子宮裏沖了出來。隨著"..player.."龜頭一遍遍的撫弄，"..target.."陰道裏充滿了空虛感。此時的"..target.."巴不得能有根大肉棒可以快點塞滿自己空虛的陰道。因此她不自主地扭動起自己的臀部，口中跟著發出呻吟聲。\n",
		"「哦…唔…人家要…」她再次懇求"..player.."。\n",
		"「嘿嘿…真夠騷的。」"..player.."邊用龜頭繼續摩擦著早已翻開的陰唇邊嘲弄著"..target.."。在淫水的潤滑下，龜頭漸漸因和陰唇的親吻而更漲大了起來。沒多久，"..player.."原本垂軟的陰莖已經硬如石了。於是他將粗硬的雞巴對準"..target.."那濕答答的陰戶。跟著輕輕一挺，龜頭已撐開陰戶滑了進去。\n",
		"但是"..player.."並不直接待整根插進，只是讓龜頭停留在"..target.."濕淋淋的陰道口而已。\n",
		"「哦…求求您…用力頂我吧…」"..target.."受不了陰道裏傳來的空虛感，哀求起"..player.."。\n",
		"「嘿嘿，沒這麽容易喔…」"..player.."有意刁難"..target.."。\n",
		"「別這樣…快…我…受不了了…」"..target.."嘶吼著喉嚨哀求著"..player.."。\n",
		"「那要看你有沒有誠意啊…」"..player.."露出了奸詐的笑容。\n",
		"事到如今，"..target.."再也顧不得什麽羞恥心了…\n",
		"「求求你…趕快插進來吧…我是個騷貨，用力的頂進來吧！人家那裏好癢啦…啊…癢得已經受不了啦…喔…啊…呀…求求你…」這時候的"..target.."已經變成了一頭淫獸，苦苦地哀求著"..player.."用他那根大肉棒來姦淫自己。\n",
		"「插什麽啊？講出來！！」"..player.."故意裝傻詢問著"..target.."。\n",
		"「用你的…快用你的…」"..target.."從未說過那個東西，害羞得住了嘴。\n",
		"「什麽啊？」\n",
		"「大雞巴…插…人家…的小騷屄啊…啊…快一點兒啊…」"..target.."顧不得自己殺手的尊嚴，脫口喊出最淫蕩的話。\n",
		"「很好！」"..player.."這才露出了滿意的笑容。跟著終於把他那粗硬的肉棒整根插進"..target.."的小屄裏面。\n",
		"「哦…」"..target.."發出了滿足的淫叫聲。先前的空虛感完全被"..player.."的大肉棒給填得滿滿的。\n",
		""..player.."開始一前一後地挺著腰，肉棒跟著抽插於"..target.."的陰戶裏。\n",
		"「啪啪啪」隨著"..player.."的挺進，"..player.."的大腿拍打在"..target.."豐潤的屁股上，發出了響亮的姦淫聲。"..target.."低頭往後看，只見自己的雪白的乳房瘋狂地前後晃動著，而乳頭已硬挺了。透過自己的乳溝，"..target.."看到了自己的陰戶，也看見"..player.."的陰莖不斷在自己濕淋淋的陰道中進出著。\n",
		""..player.."每挺進一次，屁股就被結結實實地拍打了一下，而"..player.."兩顆下垂的睾丸也跟著撞擊在自己的陰核上，怪不得"..player.."每次挺進，"..target.."都感覺自己快升上天去了！原來除了陰道被塞得滿滿的以外，陰核還會被睾九摩擦著啊！"..target.."從未欣賞過自己的陰戶被抽插的樣子，看得更專注了！\n",
		"「哎呀！！」"..target.."輕輕發出了驚歎聲，只見自己的陰戶裏不斷有淫水從裏面濺出來，一滴一滴的，幾乎都濺到了地板上面，很快的，地板上到處都是水滴，像是被噴了水一樣，"..target.."從不知道自己這麽會泄，拼命注視著自己那不斷有水噴出的陰戶，甚至看得發呆了！以往當她被男人或女人幹時，她滿腦想著下手的機會，如今，她的身心才第一次被人所征服。\n",
		"「哦…」忽然發出了驚人的吼聲，跟著全身痙攣了一下，"..player.."覺得在自己陰道裏的大雞巴有一股緊縮的力量，這股力量到快要將大雞巴緊緊的吸住。\n",
		""..target.."感覺到一股溫熱的液體在自己的陰道裏流動著，於是她輕經將身子擡高一點，一股液體便緩緩流了出來。總之那股液體不斷從"..target.."的陰戶裏流出，慢慢流過了"..target.."的屁眼，跟著流到了地板上…她也高潮了！有生以來的第一次高潮，她整個人幾乎動彈不得了。\n",
		}
	self.CH4 = {
		""..player.."眼見"..target.."在強烈的高潮下脫力，更是興奮，他的肉棒在這狂暴的抽插中居然沒有射精，反而更是漲地更大，而"..target.."溫熱的陰道中，壓在渾身無力卻另有一番嫵媚動人的"..target.."背後，"..player.."一隻手繼續蹂躪她的肛門，一隻手輪流照顧兩隻軟玉溫香的乳房，用力握緊前後揉搓，一張嘴在背後舔她背部滲出的汗水，下部更是不停的繼續抽插。"..target.."高潮剛過，下體極端敏感，難受萬分，她只能無意識的呻吟。\n",
		"羞恥的"..target.."不能言語，只是低頭別過臉去。"..player.."故意將手指從"..target.."的肛門中抽出來，湊到她鼻前去，道:「"..target.."的屁眼兒未必比"..target2..""..target2.."的好聞呢。來，自己嗅嗅，等一會我叫"..target2.."過來給你聞。」\n",
		""..player.."趁"..target.."全身無力幾近虛脫而毫無反抗，"..player.."用他仍然怒張未泄的肉棒瞄準她兩爿白晰若雪的臀肉之間，龜頭在她那淺褐色的蓓蕾上摩擦一番，馬上將腰部往前推；也不用體液潤滑，巨大龜頭的前端只管直接堅定地將"..target.."後庭的處女地給割了開來。\n",
		"劇痛之下"..target.."整個幾乎彈了起來。她這才剛回過神來，迷糊之中就感覺自己肛門遭龐然大物所侵入。她雖剛才見視過"..target2.."肛交的經過，但如今發生在自己身上，恐懼及疼痛讓她猛烈的搖著頭、擺動著臀部。"..target.."無法運內力抗拒，只得努力忍耐這幾乎有如撕裂下半身的痛楚，與剛才象牙棒比較，這龜頭又粗又硬，讓她幾乎吃不消。她散亂的長髮胡亂的左右甩動，淚珠如雨粒般地淚珠飛散在臉上，全身流滿香汗。\n",
		"一瞬間，"..player.."拔出了好不容易才插入的龜頭。"..target.."的身體立刻向前逃，眼中不由自主的露出一絲懇求之意。可是"..player.."輕易的將她用力摟近，把"..target.."的臀部高高的拉起，分開她兩片豐滿的嫩肉，運起內勁，再一次強力的插進去。巨大的肉棒輕易的突破洞口的頑強障礙，迅速的滑入"..target.."的直腸裏。肛門再次銜住"..player.."最粗大部份時，被擴張到了極限，上面原本清楚的肉褶也消失了。\n",
		""..target.."被"..player.."如此作賤，她簡直不敢相信自己會被男人如此的對待。而陰莖與肉壁間毫無潤滑，她只覺有如一根木棍刺穿自己身體一般。激烈的磨擦疼痛使她皺起眉頭努力想要咬緊牙關。──世間竟有這等肮髒殘酷的事…\n",
		"爲何是我？爲何"..target2.."屁眼被幹的時候看起來是如此的高興？──充塞腦門的難忍羞辱及貫穿身體的強烈疼痛，已使得"..target.."不知生命到此還有何意義。但"..target.."只能盡力忍耐。\n",
		""..player.."想到自己今日得以這般蹂躪武林中最神秘的女殺手，強烈的征服感使"..player.."興奮萬分；不僅如此，"..target.."未經開發的柔軟肛門和"..target2.."的榖道比較起來，其收縮更是強烈。饒是他身經百戰，當他終於逐漸的完全插入"..target.."直腸底部時，卻也險些當場射了出來；他趕忙深吸一口氣，穩住陣腳。\n",
		"「好屁眼，你的屁眼肏起來果然與"..target2.."真的是一時瑜亮。」"..player.."得意地說，他倒沒有急著大力抽送，只是開始慢慢轉動腰部，反覆地做圓型運動，細細的品嚐這神仙般的快感。肛門內的肉莖不但早已膨脹到極限，在多重的身心刺激下更已充血到前所未有的大小，明顯可見隆起的青筋靜脈。隨著他的動作，只見"..target.."菊花蕾的柔軟嫩肉也跟著扭曲起來。\n",
		""..player.."臉上又露出了淫虐的笑容，一面把"..target.."的頭壓在地上，一面撫摸她充滿彈性的乳房，用力捏著她美麗的乳頭。他在體內又轉了一會，享受夠了又熱又緊的感覺，開始緩緩抽送，道:「嘿嘿，"..target.."，我今日讓你領略領略肛交的樂趣!我倆等會完事之後，只怕你再也離不開我啦。」\n",
		""..target.."體內既毫無潤滑，自然只感覺痛楚，哪里有什麽肛交的快感。她依賴了數十年的內力又陡然盡失、現下身子只較一般從未習武的女子更加柔嫩敏感，更加無法忍受痛苦。她心裏雖是一百個不願認輸，勉力撐持忍耐劇痛，口中卻是不聽使喚的開始低聲呻吟。\n",
		""..player.."這時卻也發出了不同的呻吟。他只抽插了沒幾下，只覺全身血液好似集中在他那話兒般，"..target.."腸內的嫩肉緊緊的箍住了他，體內好像有著不知名的力量驅策著他要更快些、更快些。再抽插十餘下之後，"..player.."逐漸大膽起來，運起內力，腰部速度開始加快。\n",
		""..target.."登時腦裏如遭雷轟，下身若受電擊。「啊…!啊…!啊啊…!」\n",
		"她終於熬不住，瘋狂絕望的呼號，身子死命的扭動。要知"..target.."身體本已因連續高潮而快虛脫、瀕臨崩潰邊緣，"..player.."慢慢抽插還好，當她最是嬌嫩隱私的內壁遭他運起內力快速磨擦時，這感覺只有裸身遭狂奔快馬拖行急馳差堪比擬；那痛楚與羞辱卻是百倍過之。這份痛苦遠甚於刀割鞭打、遠甚於世間一切酷刑，任"..target.."武功再高，終是血肉之軀；更何況她現時早已內力全失，無從抗拒?\n",
		""..target.."仙女般美麗的身體如同整個被撕裂成兩半一般，一波一波一生從未受過的痛楚襲擊著她，痛苦萬分的她只能拚命的流著淚與冷汗悲叫慘號。"..player.."只是充耳不聞，繼續加速，也不知他只是毫不在意，還是根本故意想要多聽聽這如花似玉的美人兒悅耳的呼號。──疼啊！停呀饒了我吧你到底要怎地我什麽都依你什麽都依你呀──無法言語的"..target.."在心裏大叫求饒，可惜"..player.."就算能聽見，怕也只是更加得意的冷笑而已。\n",
		""..player.."在抽出時突然注意到自己陽具上沾有少量鮮血，想是肛門內部嬌嫩的皮肉早已被他磨破，只是他快活之餘並未發現。他彷佛得到一種奪去"..target.."處女之身，使她在自己身下落紅的勝利感；心裏一陣興奮，突然機伶伶的一個冷戰，翻起白眼，野獸般的吼叫一聲，全身發生痙攣。"..target.."只感覺身體裏的巨物陡然快速膨脹，然後噴出一股股的熱流。\n",
		""..player.."一次又一次的噴射在"..target.."的腸內，然後無力的將上身覆蓋在她的背上。"..player.."慢慢的從"..target.."早已不聽使喚的身體內抽出時，幾滴鮮血也隨著白濁的精液從她的肛口處流出，將她身下地板染得濕濕的一灘。"..player.."故意將抽出的雞巴在"..target.."眼前晃動，又將精液與鮮血在她的臉上拭淨。破碎的自尊再一次的被踐踏，"..target.."原本冷豔的臉上，已露出迷離的表情。\n",
		""..player.."藉著先前的潤滑與及淫液之助，"..player.."輕而易舉的就進入了"..target2.."的菊洞之內，這一次"..player.."可沒那麽客氣了，甫一進入，就是一陣快速的抽送，更將左手手指插入"..target2.."的秘洞之內不停的抽插摳挖，不消片刻工夫，"..target2.."已經發覺從後庭的菊洞之內傳來陣陣快感，再加上"..player.."左手手指在桃源洞內不住的摳弄，粉頸玉背上還不時傳來"..player.."輕柔綿密的舐吻，陣陣快感如浪濤般襲來，至此，"..target2.."的理智終於崩潰，完完全全的沈醉在淫欲的浪潮之中……！！\n",
		"只見她隨著"..player.."的抽送，柳腰粉臀不停的篩動迎合，發出陣陣啪啪的撞擊聲，口中嗯啊之聲不絕於耳，嬌媚的語調媚惑得"..player.."更加的狂暴，就這樣的，"..player.."輪流的在"..target2.."的前後洞大刀闊斧的快意騁馳，插得"..target2.."幾近瘋狂，口中不停的淫叫著：「啊……好棒……好舒服……啊……太好了……再……再來……用力……哦……對…太好了……啊……又……來了……不行了……啊……我不行了……」整顆頭不停的左右搖擺，帶動如雲的秀髮有如瀑布般四散飛揚，嬌軀奮力的迎合"..player.."的抽插，一陣陣的乳波臀浪，真有一股說不出的淫靡美感。\n",
		"兩人就這樣瘋狂的交媾著，完全無視於在旁的"..target.."，約略過了一柱香的時間，"..target2.."終於忍受不住那股絕頂高潮，只見"..target2.."突然一頓，全身肌肉繃得死緊，擡頭叫道：「啊……不行了……啊……好舒服……好……好爽……啊……我……我泄了……」刹時一陣天旋地轉，全身不住的抽搐抖顫，"..player.."只覺"..target2.."的陰道嫩肉一陣強力的收縮旋轉，死命的夾纏著胯下肉棒，夾得"..player.."萬分舒適，急忙將肉棒緊緊的抵住屄心嫩肉不停的磨轉，轉得"..target2.."汗毛直豎，彷佛升上了九重天外，在一聲長長的尖叫聲中，一道滾燙的洪流急湧而出，燙得"..player.."的雞巴不住的跳動，泄完身後的"..target2.."，整個人癱在"..player.."的身上不停的嬌喘著，雙頰浮起一層妖豔的紅雲，嬌軀仍不住的微微顫動，再也無法動彈分毫。\n",
		}
	self.CH5 = {
		""..target2.."的雙手都按在"..target.."的乳峰上，她一邊輕柔地揉弄，一邊用嘴含住"..target.."的耳垂，口中丁香小舌，小心翼翼地舔著耳垂的邊緣。\n",
"從"..target2.."口鼻呼出的陣陣熱氣直對著"..target.."的耳朵，再加上敏感的耳垂傳來的舒適觸覺，一種酥麻至極的感覺不停地沖擊著"..target.."的神經，這比"..player.."在強暴她時的感覺感受差太多了，尤其是讓她的愛人如此的挑逗她，她感到渾身發軟，原本繃得緊緊的身體漸漸放鬆下來。\n",
""..target.."不由自主地閉上眼睛，感受著"..target2.."軟軟的雙唇溫柔地吻過她的耳垂、面頰，她自然而然地側過臉，微啟朱唇迎向"..target2.."。在兩人嘴唇相接的時候，她們又不約而同地一陣激動，雖然是在"..player.."與..target3..眾目睽睽之下，但這同性間初吻還是令她兩人心中感一陣陣的悖動。\n",
"經過一陣短暫的試探和追逐，兩人完全沈醉到接吻帶給她們的幸福感當中去，似乎已經忘記了周圍的一切。她們開始長時間的深吻，在紅潤的嘴唇的開合之間，兩片香舌緊緊纏繞在一起，互相用力吸吮著。\n",
"在一番深情的熱吻中，"..target2.."開始從"..target.."的嘴唇一路向下吻去，而"..target.."也配合著她的動作，將頭向後仰起，露出美麗的脖頸。\n",
"在"..target2.."火熱的嘴唇落在"..target.."的玉頸上時，"..target.."不禁發出一聲嘆息。"..target2.."此時幾乎將上半身完全趴在"..target.."的身上，她雙手握住"..target.."嬌嫩的雙乳用力吻著，同時用指頭輕輕捏著"..target.."乳峰上的尖端。在"..target2.."的愛撫下，"..target.."的乳頭開始發硬，她感到渾身發熱。\n",
"一種溫暖濕滑的感覺從"..target.."已經勃起的乳尖上傳來，"..target2.."在用舌頭舔著她的乳頭，隨後將她的乳頭完全地含進嘴裡。來自敏感的乳尖的強烈刺激沖擊著"..target.."的神經，她忍不住哼出聲來。由於愛撫"..target.."身體的是她的心儀已久的"..target2.."，她對"..target2.."的動作沒有任何抵抗，因此很快就產生了無比的快感。\n",
"一陣陣熱流沖擊著"..target.."的全身，她開始不停地扭動誘人的肢體。"..target2.."的愛撫就有如一根導火線，將長時間積壓在她體內的欲望全數引燃。\n",
"「很好，就是這樣。"..target2.."，你把她扶起來，你們要互相刺激。」"..player.."興奮異常，他要好好欣賞這對女子的表演。\n",
""..target2.."聽了"..player.."的命令，更是加快對"..target.."愛撫的動作。她將"..target.."扶著坐起身子，然後托起自己豐滿高聳的乳房送了上去。\n",
""..target.."不假思索地將"..target2.."鮮艷的乳頭含在嘴裡，一邊用牙輕咬著乳頭根部，一邊用舌頭一下一下刺激乳頭尖端，"..target2.."的乳頭幾乎是立即就硬了起來。\n",
"兩人這時又擁在一起深深的吻在一起，兩人不停的扭動身體，讓兩對尖挺的乳房不斷的摩擦，也讓早已硬如小石的乳頭不斷的摩擦，兩人皆感覺到乳頭硬到讓自己旳胸部都有些難過。\n",
""..target2.."這時整個人趴在"..target.."的身上，她雪白的臀部一上一下的晃動，甚是吸引著"..player.."的目光，"..player.."走到"..target2.."的身後，他將手指插入"..target2.."兩腿之間的深褐色的屁眼，手指頭開始緩慢地抽插起來。\n",
"「啊……噢……」從屁眼處突然傳來的強烈刺激令"..target2.."渾身顫抖，在"..player.."的調教下，"..target2.."的身體已經愈來愈敏感了，更容易就能將她的欲望挑逗上來。\n",
"「"..target2.."，你現在可以去刺激女殺手的肉洞了。」"..player.."命令著"..target2.."，他自己也轉移陣地到"..target.."的身後，他坐在"..target.."的身後，胸膛緊貼住她的後背，雙臂環抱著她的身體，兩隻手用力抓住她的乳房揉了起來。\n",
"粗糙的手摩擦她嬌嫩的肌膚，讓"..target.."稍稍清醒了一些，她想起自己是被擄來，被"..player.."所淩虐的，但官能的欲望被"..target2.."挑動起來的她，對這種玩弄雖然仍會覺得屈辱，但已經沒有了原來的那種的抗拒心理，在"..player.."看似粗魯實則巧妙的玩弄下，她開始感覺到一種夾雜在屈辱之中的快意。\n",
""..target2.."跪在"..target.."大張的兩腿之間，剛被"..player.."的幹過的"..target.."的嬌嫩花瓣還有些紅腫，微微向外翻起，蜜洞裡和四周都是淫水和精液的混合物，將"..target.."的蜜洞弄得一片狼藉。"..target2.."看著眼前的景象，她雖有一絲愧疚感，但卻興起另一股要作弄她的念頭，要讓這位迷戀她的女子永遠臣服於她的心理。\n",
"一種作弄"..target.."的心情使"..target2.."不由得產生她要將"..target.."的情慾完全的挑起，讓她沈醉在性慾的漩渦中，她慢慢把嘴湊過去，伸出舌頭小心翼翼地舔了起來。\n",
"下體傳來的奇妙觸覺令"..target.."心裡更加混亂，她竭盡全力抵抗這股性感，但是她又渴望能與心愛的人共效於飛，當她低下頭看著正在用舌頭舔著她下體的"..target2.."，小聲哀叫道﹕「不！不要啊，"..target2.."。那裡很髒。」\n",
""..target2.."並沒有停下來，她反而一點一點地將"..target.."肉洞周圍仔仔細細舔著，然後慢慢扒開"..target.."的花瓣繼續舔了起來。\n",
"敏感至極的花瓣被愛侶舔的刺激，令"..target.."一直強忍的呻吟逐漸從牙縫裡漏出聲來。而當"..target2.."舔到"..target.."充血的嫩芽周圍時，她感到一陣陣巨大的快意，這種快意是如此的強烈，以至於"..target.."的腦海一片空白，她的肉洞已經非常濕潤了，而"..target2.."的動作在"..target.."已經完全的動情下反而加烈，她輕輕用牙齒輕咬著大陰唇，這一來，更讓"..target.."大聲的淫叫，她已經放棄抵抗了，她要完全的享受這一份快意的感覺。\n",
"而身後的"..player.."也不失時機地用嘴含住"..target.."的一隻耳朵，用牙齒和舌頭輕輕挑逗著，雙手開始大力揉弄她的乳房，還不時用力捏著她的乳頭。下身的蜜洞、上身的乳房和頭部的耳朵這三個性感部位同時受到強烈刺激，不斷傳來的觸電般的酥麻感，令"..target.."的性感迅速膨脹爆發，肉洞中分泌的蜜液開始泛濫。兩個美女相互刺激如同白蛇般的糾結在一起，這時的"..player.."也不閒著，他將"..target2.."疊在"..target.."的身上，兩人面對面的交疊，兩對白嫩的乳房擠在一起，兩位女人粉紅色的乳頭不停的磨擦，讓"..target2.."感到"..target.."的乳頭堅如小石子，而自己的乳頭也因充血地有點痛。\n",
"交疊在一起的美女，面對面的擁抱，兩人間的熱吻也更是強烈，"..player.."這時站在床沿，用雙腿大大分開兩位美女的雙腿，這一來兩位美女的陰戶與屁眼都清晰可見，"..player.."蹲在地上看著兩的蜜屄不斷的流出蜜汁，他用手輕揉"..target.."那早已外翻的大陰唇，而將嘴湊向那"..target2.."早已洪水泛濫的陰戶，這一來，讓"..target2.."與"..target.."幾乎同時達到小高潮，也許是兩人皆拋去那股害羞的心理並有著相互競爭的心情，兩人的淫聲浪語不斷相互刺激，而手指與舌頭已無法滿足兩位已經浪到最高點的俠女了。\n",
""..target2.."將自己的大腿與"..target.."的大腿緊緊的交疊，讓兩人的陰唇不斷的摩擦，但是，如此的假鳳虛凰根本無法滿足性慾高漲的兩人。\n",
"「主人！快用大雞巴插入我"..target2.."的騷屄中，好癢！」"..target2.."首先放棄了矜持，希望早日填補那一份騷癢，"..player.."聽到"..target2.."如此淫蕩的要求，站了起來，用龜頭輕觸那"..target2.."早已期待緣客掃的蓬門了，"..target2.."不禁由口中吐出滿足的呻吟。\n",
""..target.."見狀，唯恐自己受到冷落，也馬上叫到：「快肏入我的屁眼中，我要大雞巴，幹我！快幹我！」這時的"..target.."早讓肉慾衝蝕了她的理智，能滿足她的只有"..player.."的大雞巴。\n",
"聽到了"..target.."的哀求，"..player.."又將雞巴自"..target2.."的肉洞中抽出，直接插入"..target.."的屁眼中，這一來，"..target.."發出滿足的嘆息，而"..target2.."的口中卻也發出了抗議嘆息聲，"..player.."輪流的玩弄著兩人四個洞，直到兩人嬌喘連連，哀饒不斷，這時的"..player.."才開始對準"..target.."的屁眼前後做起活塞運動。\n",
"這一來，讓"..target.."馬上在潰堤邊緣，不停磨擦著黏膜。\n",
""..target.."發出像是悲鳴似的呻吟，身體苦悶的扭動著。"..player.."更用力的來回抽動著。在早就濕淋淋的肉屄中，"..player.."前、後、前、後有節奏的抽動著，在一旁的..target3..看著"..player.."幹著"..target2.."和"..target.."，苦悶的自己用手指撥弄。玩弄兩位美女之餘，"..player.."還不時看了..target3..一眼，他心想：「真是個風騷的小傢夥。」\n",
"在"..target.."即要高潮之前，"..player.."卻將雞巴從"..target.."的屁眼拔了出來，插入"..target2.."的小屄之中。這一來讓"..target.."從高潮的絕頂立刻跌到深淵，而"..target2.."馬上感到非常的很舒服。她巧妙的扭著小蠻腰，給了"..player.."莫大的快感。\n",
"「拜託你…我也要…拜託你…」"..target.."如夢囈般的向著"..player.."懇求著，她只能抱緊"..target2.."，兩人用力摩擦乳房好減輕那一股苦悶的感覺。"..player.."在她們兩人之間交互刺入、拔出。從兩人陰部流出的愛液，交雜的混在一起，上下疊合的"..target2.."和"..target.."瘋狂激烈的舌吻著，口中浪叫不斷，一點都沒有俠女的風範，十足成了沈浸在性慾中的浪女了。\n",
"兩個人的意識都已經朦朧了，馬上就要達到甜美的高潮。"..player.."看著完全屈服在自己肉棒下的兩位肉奴，"..player.."的嘴角不禁浮上一抹笑意。接著，"..player.."的身體突然生起一股熱潮，在體內沸騰著。「哈啊啊…」「嗚嗯嗯…」她們兩人同時達到高潮，"..player.."見勢立刻將肉棒抽出，將濃稠的白色體液噴在這兩個奴隸臉上，兩人的臉上都澆上白色濃稠精液，兩人伸出舌頭將對方的臉上的精液一一吞入口中。\n",
"一次肏了兩位美女，"..player.."也感到有些累了，但是他又想到新點子，這兩位美女都喜歡肛交，那麼就再好好的淩辱她們。\n",
"「"..target2.."、"..target.."給我爬起來，兩個人屁股對屁股給我像狗一樣趴著！」他命令兩位全身虛脫的女人屁股對屁股的相對，然後他拿出象牙製的雙頭象牙雞巴拿出來，這時三個女人都好奇看著這個東西。\n",
"「這叫做雙龍交歡棒，專門讓兩個女人互搞用的，嘿，把屁股擡高一點。」"..player.."在"..target.."雪白的屁股打一掌時，連"..target2.."也急忙擡高屁股，這時"..player.."立刻將雙龍交歡棒先插入"..target2.."濕淋淋的陰戶之中，然後再將"..target.."的屁股已移進插入她的陰戶之中。\n",
"連接在二個人的肉洞裡的象牙棒，露出約三寸左右的長度。同時在水蜜桃般的屁股溝裡，有茶褐色的菊花蕾正對著天花板，二個女人好像要比較似的排列在一起。\n",
""..target2.."的屁眼顏色比較深，在肛門的四周也看到不少短毛，而長短不一的陰毛幾乎吞沒了陰戶，不過因為陰唇腫脹，讓陰戶還是露了出來，因為是最聰明的女人，看起來更是顯得淫穢，而"..target.."的陰毛較少，整個騷屄與屁眼看的一清二楚。\n",
""..player.."的手指用力地插入"..target.."的屁眼中。\n",
"「哇…啊…」雖然"..target.."的屁眼已經被肏過了，她還是發出尖銳的慘叫聲。\n",
"「啊…好難過！」"..target.."對突然插入的手指感到一種變態的快感，忍不住扭動屁股發出哭叫聲，可是扭動屁股又有女人雙龍交歡棒摩擦著肉洞。\n",
""..player.."插入"..target.."屁眼後，另一隻手也不閒著，食指又插入"..target2.."的屁眼中。\n",
"「啊…」\n",
"「唔…」\n",
"兩人的屁眼受到外來的刺激，"..player.."開始把二個女人的屁股貼在一起。\n",
"「嘿嘿嘿，這樣就好了，我要開始好好的玩弄她們。」\n",
""..player.."用左手抱緊"..target.."的屁股，接著用右臂把"..target2.."的細腰摟緊，然後雙手一起用力把"..target.."和"..target2.."的屁股互相頂撞摩擦。\n",
"「啊…唔…」\n",
"「哦…啊…」\n",
"女人的肉洞受到強烈的攪動，象牙製的龜頭摩擦彼此的子宮口，這種情形可以說是用快感的刑罰。二個女人的臉都仰起對著天花板，露出無比妖艷的表情發出哼聲。"..target2.."的雙手抓緊床單，後背向上彎曲，"..target.."的長髮向左右飛舞，流出口水嗚咽。\n",
""..player.."更高興的旋轉"..target2.."的屁股畫圈圈。他還抱住"..target.."的屁股前後活動，二個女人的屁股相碰時。從肉洞口流出大量蜜汁。\n",
"「啊…」\n",
"「唔…」\n",
"除二個女人的吼叫聲外，還有淫邪的摩擦聲，加上屁股和屁股相碰的聲音，都增加房裡的淫蕩氣氛，這時"..player.."又拿出另外一串用珍珠串成的珠串，他首先對著"..target.."的屁眼，將一顆顆的珍珠慢慢的塞入，只見殺手姑娘不停的搖頭哀鳴，而"..player.."根不不理會，塞住了進十顆珠珠，"..player.."將珍珠如法炮製地塞入"..target2.."的屁眼中，如此一來，兩位俠女的屁股有了兩條連接的尾巴了。\n",
"「唔…不行啦…好痛！」"..target2.."首先表示痛苦，"..player.."這時停止摩擦二個女人的屁股，"..player.."開始用手拍打兩位美女雪白的屁股，"..target2.."與"..target.."不斷搖動屁股表示疼痛，但是，在屁股相連的異物，讓兩位美女產生從所未有的快感，這時"..target2.."與"..target.."兩人只想不停的擺動屁股，好讓那一股苦悶降低，而"..player.."不停的淩虐兩位美女的雪白屁股，讓兩人的身體不停的搖動，卻又不讓塞入的異物掉出來。\n",
""..target2.."這時從直腸傳來無比的快感，她首先尖叫一聲：「不行了！」整個人癱在地上，緊接著"..target.."也大聲尖叫：「我洩了。」她整個人也癱了。\n",
""..target.."已經是任由"..player.."擺弄，她被拉著爬時，從肉洞裡掉出沾滿蜜汁的白色象牙雞巴，一來白色象牙雞巴留在"..target2.."的肉洞裡，看起來像白色的尾巴一樣，而真珠鍊卻留在"..target.."屁眼中。\n",
"「哈哈哈，妙極了…"..target2.."和"..target.."都有了尾巴，真的像狗一樣。」"..player.."嘲弄著兩位因高潮而倒地不起的美女，"..player.."將真珠一顆顆自"..target.."的屁眼中拉出，隨著"..player.."的節奏，從"..target.."口中也吐出了滿足的嬌吟，當最後一粒珍珠自屁眼中拉出時，"..target.."又產生了一次小高潮。\n",
"「我投降了，只要能再享受這樣的感覺，我要永遠臣服於你的大肉棒！」"..target.."的身心已經被"..player.."征服了，"..target.."回想這八年的殺手生涯，讓她完全摒除自己的情感，而冷血的對抗敵人，如今，能與心愛的人共效於飛，讓原本感情是豐富的她，一下子全部的渲洩出來，縱使所付出的代價是成為"..player.."肉棒下的奴隸，但是，終於可以勇敢的表達自己的情感，"..target.."也決定臣服於"..player.."了。\n",
}
	table.insert(self.chapter, self.CH1)
	table.insert(self.chapter, self.CH2)
	table.insert(self.chapter, self.CH3)
	table.insert(self.chapter, self.CH4)
	table.insert(self.chapter, self.CH5)
	self.API.text_list = self.CH1
	self.Count = #self.API.text_list
	self.API.Count = self.Count
	self.ChapterCount = #self.chapter
end
